Revit 2027 API
BarTypeDiameterOptions.BarNominalDiameter Property
 Represents the bar nominal diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarNominalDiameter { get; set; }
Public Property BarNominalDiameter As Double
	Get
	Set
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
member BarNominalDiameter : float with get, set
Property Value
Double
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace